config.el

(load-module 'dired-tweaks)

(load-module 'ebook-tweaks)
